#### 🖌 Terraform Format and Style ->`success`
#### ⚙️ Terraform Initialization ->`success`
#### 📖 Terraform Plan ->`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_integer.env: Refreshing state... [id=8772]
random_uuid.ra_id: Refreshing state... [id=872df478-6ec5-2f04-f3f0-ffd17bfeb1ad]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online]
azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.OperationalInsights/workspaces/law-aks-office-hours-default]
azurerm_user_assigned_identity.aks: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-aks-default]
azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourcegroups/rg-espc-online/providers/Microsoft.ContainerService/managedClusters/aks-office-hours-default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + login_server                  = (known after apply)
      + name                          = "thns8772default"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-aks-office-hours-default"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }
      + trust_policy                  = (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster.aks must be replaced
-/+ resource "azurerm_kubernetes_cluster" "aks" {
      - api_server_authorized_ip_ranges = [] -> null
      - automatic_channel_upgrade       = "" -> null
      - disk_encryption_set_id          = "" -> null
      - dns_prefix_private_cluster      = "" -> null
      - enable_pod_security_policy      = false -> null
      ~ fqdn                            = "aks-default-bfaa62f4.hcp.germanywestcentral.azmk8s.io" -> (known after apply)
      ~ id                              = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourcegroups/rg-espc-online/providers/Microsoft.ContainerService/managedClusters/aks-office-hours-default" -> (known after apply)
      ~ kube_admin_config               = [] -> (known after apply)
      ~ kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZIVENDQXdXZ0F3SUJBZ0lRWG1kUWRIaTVDbU9JYlZMbTRYVW5jakFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWVGdzB5TVRBMk1ETXdOakF6TkRCYUZ3MHlNekEyTURNd05qRXpOREJhTURBeApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1SVXdFd1lEVlFRREV3eHRZWE4wWlhKamJHbGxiblF3CmdnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUURIZ3ZTSjFhbi9iZW1mL2RDeFoveFkKeklLbGh6TnBwZXFNbFVsbmF5Z3pkMy82Mk92ekZpaWJzc0k0YmtMZFVtakFUaEhUQ0UxeHB2TWQrYTN6QlNIUgp3NzVFeDRIZlY5ajNxbmVLcmNkZlRLTGxMTkRReDFqaUY1WSsvbG1aQXdjNnNqQm5MaUVFcUQ0SGxxTVpUaEo0CjVjSXVxbXRFdktXdzZJOFRjeEcvcU1PMTErM3drNWlSM2ZOajMrMmpLY3dGdjQvS1B0UWRhSjlacmJiejlHeUUKR1duYWxJWTBGRkdOdmhvKzJNTnlucUcvdUtMRU5uL2N2Tm5hWnRETi8zL05zV2x3bnJMU0FFOCtaQ01HNC9xdgp4S3crMi9RL1M3SXJWVk5BczJpK21DL0xWUlV0cDQxV0pxNDNHYjRFUGhwaEhJNDlJZUdJWUNTM0xVYmVXK2VWCk9KMkhPc05KZTFkTEY2Z2JzUlBPSjdHd0VodXBya1dEbi9CYkNTQ1Zsdk5XTnhpcEJqVUs3eUR5SzhMdjFWRksKaTU5cEloaVp6dDRxa2ZWcENHSEgybEdMd0lvaFRlNnV6ajN0dXBOUjZsRk9QRHpvMllHUDJJVGVPbDRMb0E3WQpaUlMvdkl5OVdsOEkxZ0JTbmFmdDBRaUF4MDVra1FBWmNZTERUWlhzS25zRXFDRmhCRDM4OTZ5TXVDeHFGMzFnCk1PMnMwYkVjNVFJaHE3TG5GSTB0ZDdsUG8vWkphaVVjZVZVU0o5VTIxQm16UnRzcTR0dVlHZXlRYlVsdDVUNFUKOUxFbUw5dzg1NWFCTC9mdUYzZ2szekgwRjNlYmRiZWkxWk8yVDVqaEZsYnF0SnJHL3FQQlZxQ2QzT01BR3ZiMQpMZHF3RTNYQzFnc09YZzBpaTdDMVpRSURBUUFCbzFZd1ZEQU9CZ05WSFE4QkFmOEVCQU1DQmFBd0V3WURWUjBsCkJBd3dDZ1lJS3dZQkJRVUhBd0l3REFZRFZSMFRBUUgvQkFJd0FEQWZCZ05WSFNNRUdEQVdnQlNiQWdOb08rbFkKL29wVDJMN0Z6MHRUVXFXT2pqQU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFQUHpsZmphMUQ0UXByT0Q4SzduNgpjeXdQb000d01ubGw1dEN1aWFEQlIzbkhZaExkV01sOWNWUm1nQ0RCTTNraTF5VVJIRmxVOVN1Z3B3REtkeEd3CjRSZVBFOGh1RnZYMGtUNDVvYld5MjIrTGZ2NVRGeDlYSy9taVEwM3IybE9YT0RoRWxUekZETFpYZ3JBU3c1dFYKQkxtR04weDY4M3hxYlN6OWZzY2hZNG9wcXFjWVpEYjl0V0tLOFBGeFRlMkpRdU9BeXpCc2tEaDJEZG5iUDhUZQp2OTIzNjJjMXFRWkw0KzdMWkJPc3ZRWG5yaEN5MHliMGxGRjdLTHZkL3h5WnpHVUFuL1BPUURQaVpuYTh6RWVPCk9IejNVbHJlb215UzFXQkR2Mml5ak5yVVlKUjNyRERJVnJYc3gyYVV5cTlhWldqdE5yT25vZFQ2R1hha1V6aGIKaXhQL2NTZ29FamRZRWlSemRmVCttL0tnbWNSTVZMUWxsamRSU09qdnRMek9HNG5MLzNWSGJ5cmk5VWdjNjQyUQpYWkwzeno5SU9wYmFvS1BQYUlHTWNnZjJ3UjZqWklMRVV1eVM4dWVsbm9RdGlFcXFYM2h0bHU2eHJhcEhYV2JFCkFLdks3bVdpZ0czZTlkQmY5YXB0bDZlSXlwME94YURpZ0tUUkJHYXFDN0VBaVI2aFlLKzVCVHk5RkloKzZ1c2QKVENHdnZpK1pnY1VEVVVNTkZuTk1nTStYODRML3ZBMDJGbjRwMGYzcmp6RmE1dUpZcmNVamFrczlBODdEcFNiRApZK1FlYnRmRnpEYi9wa2kydEh1RVRsemJGWG1PQW9GQ28wVitWMDk4R1NJc0dscmFZRThrSjdVR3I2UkRvdXRxCk0ySStIRjhHVkc5b0E5cytuelAyRDdBPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKSndJQkFBS0NBZ0VBeDRMMGlkV3AvMjNwbi8zUXNXZjhXTXlDcFljemFhWHFqSlZKWjJzb00zZC8rdGpyCjh4WW9tN0xDT0c1QzNWSm93RTRSMHdoTmNhYnpIZm10OHdVaDBjTytSTWVCMzFmWTk2cDNpcTNIWDB5aTVTelEKME1kWTRoZVdQdjVabVFNSE9ySXdaeTRoQktnK0I1YWpHVTRTZU9YQ0xxcHJSTHlsc09pUEUzTVJ2NmpEdGRmdAo4Sk9Za2Qzelk5L3RveW5NQmIrUHlqN1VIV2lmV2EyMjgvUnNoQmxwMnBTR05CUlJqYjRhUHRqRGNwNmh2N2lpCnhEWi8zTHpaMm1iUXpmOS96YkZwY0o2eTBnQlBQbVFqQnVQNnI4U3NQdHYwUDB1eUsxVlRRTE5vdnBndnkxVVYKTGFlTlZpYXVOeG0rQkQ0YVlSeU9QU0hoaUdBa3R5MUczbHZubFRpZGh6ckRTWHRYU3hlb0c3RVR6aWV4c0JJYgpxYTVGZzUvd1d3a2dsWmJ6VmpjWXFRWTFDdThnOGl2Qzc5VlJTb3VmYVNJWW1jN2VLcEgxYVFoaHg5cFJpOENLCklVM3VyczQ5N2JxVFVlcFJUanc4Nk5tQmo5aUUzanBlQzZBTzJHVVV2N3lNdlZwZkNOWUFVcDJuN2RFSWdNZE8KWkpFQUdYR0N3MDJWN0NwN0JLZ2hZUVE5L1Blc2pMZ3NhaGQ5WUREdHJOR3hIT1VDSWF1eTV4U05MWGU1VDZQMgpTV29sSEhsVkVpZlZOdFFaczBiYkt1TGJtQm5za0cxSmJlVStGUFN4SmkvY1BPZVdnUy8zN2hkNEpOOHg5QmQzCm0zVzNvdFdUdGsrWTRSWlc2clNheHY2andWYWduZHpqQUJyMjlTM2FzQk4xd3RZTERsNE5Jb3V3dFdVQ0F3RUEKQVFLQ0FnQnRSSDZUZ3M2eEUweHhrSHdjdlh2S1VtOTNJcjM0cmFMd3pjNCs4c1E0czhrRzVJa05RR1NMS1hNUApudXZGOVIxanZSNHIrdzhYSUwxai9GdlZqa2tBYm5rbGlETEwxSHdDNEh6S0dmVG9iN3VEVW5FbTl4YnA5TXNYCnd3dmxMbkJtS0RNMFAySmIvNXpCWVRJQWFPN2JBZExBNWhzTHNWbjVzdFN4YlVNYU9kNitGLzI3MWNvb2tXdDgKbHFhNnh1aHplWC9SMzJraWxpczMzVmttOFFZQnJ6MTNOZ0x1UVBhTmI4RkdERWUyM2NSdWtUdXJ4TUZ3Ym9uTwpBS041UHVhTERCQllXc0pMRzFwTExHSzJvbU9vb2tsSHdBVmNLU1B5Y2ErLzdzSitLREY4NWlOTU5zakVseml3CitzdEQzWk5xL2syMGszckd5d2t3dlg1angrZmpyV25XcjRTRDhlS1BiclVvb0Vab2dpY3FmbkRnb0dvWnpaclIKOFJLcCtma2toMHo3dUtlMFcxQjJOaDJNYjJaajF3ZnlpS2RlV2NuK29aUUJOQjBseWc1aXpvRkIvK092N003NwpUM0h3Sk95QUNISEtSNVJWT0FveWkxcStvMCtiL3BVM1doV1lETGthWFNtRUR0Q2x0emdCOFl3YmR6M2x2ekhPCklEeFk4SFAxUGg2QXhLZCtkazNxK2hkVHQ1azZpb29RcTBqaUJrQWhwalduaTVMTkVYaXNzMlVDdmFsZmh4eWcKWjdybldPaE5lTWVKK3lYUnJEWUI0dk9pejNCbVlTdUd2UGZIalJrNC9ydGY0SzlZYnFLbDdiY3cvM0d1elQvdAo4RW5DbDMwMHhYdEpqTmxXeXlWNGV2ODNjTzcvVTZYWVNVMHJmdW1Xc09YeWMyUFVvUUtDQVFFQTRTeE0vTk5MClRHN0ZwRmhTU1dqdzVTUHoxNU5lVmUzdXh5Q0haNWJ2OGx6Y3Q3WkdsVU5WblE3aEVCOXBzZjVka1RrY2VqTk4KdVAzSmdscHNDazFEbHpPKzZwd205bkNqbEZSTjEwU0NSdUZ0OUp2NCtjTVErS2ZOS09SK3pmb1BCVllhZjF3dgpEQjl6LzF4dDRId1BGNGpRMWhPVmFXSEpncWZlejBuV1JGaDNuR1JxR0VqZlkzTjQxNDNRaVZIVm1raEtJVm53CkZVWSs5dzNZK1lMSmduLzIyNndTY1F0WnlsMmkxOEJqeSsreFpSRC9oYTd5akNOVGluc3Z4bnI3RUdyU1JHUGQKaGwyc2dyaTdWOWE2NDhFdW0wZWIxcW11NWZ3aHhsWXBFK05icHhPdDVyMWtUMis2ZGcvSlJnekFpQ3VWdWpMLwpycXNSYmgzN0w1d1dyUUtDQVFFQTR0Tko5MVZUVVpwMmlPenNaSm10VGpJbTNBYlNMZWdsQ1NvWXI5SEM4QnFWCk1rSk5vYlk5THc4eUpkakl2V2VMSWxQcVdxT2pHd3VCVm5RSWUxZW5YYTdaMU4zT0s1bzBHdWJvQTVER0MrUnAKUlQyWDBOeWNFa3plWEZrRkNRcC82T3MraUJmMG9YSVhnQjUzd3hRNjBXVGNpemRIVXhaVnQzZitZRTlDRjVrbwpCQ0U1WnAzNDN0VFM2cEVpcVFmZkpwbXFadGFRSXBNWXV2OWFGYUcvYlliSngzRjJmdWk1ZU9HU0Vyb2RkWG56CllhUzRKcDdyL2dsaW1FTWJkT1B3aU5VQTBWZEN2TDdUSnBmbC8xSUpwVzV4T0szb1FGYjI3cFRNR2pvYWs0bk4KZUV4STVuZHpqanQwTXMrd0RTWm1ocVpzWWlweFRZWnJkTDlkWW5ESW1RS0NBUUI3blNCZW8zaHc2MWJoRkFPSQpmVzNSdlZ6OStjOE9DV0xPT2xOYlVRZEUzQ25uU00rUzNiWkFWSXpGbHhrbE4ra1I4bkpwdTRSdGpCVjExRUgvCm5jNy9VTTc4YU9FUzVWOUg3TWdXNTJ0RmtqZ1UweE5wdWVhMU94bHIyNVNwYXgrWDVGOERrQTNiNytCMFRiK2MKUHo3aHdxQXpCZWsrUXdxbkNaVk40dEVZRUNFSjRDNUdTcXNvSTVveGE0OFI4N1Q1ejdteWVYZE5scFMyZUFtbgpZRjlUbndCY05DaWptb0dla0t6M0dJMHd4ZE56RWxQVWhlaHRlbTlBVk1RemlBd1FSVFJOaXkxdnVEa2VRbC9HCnB3Rk9TeDFVN1lqbDNaMUFjSnZ5RUJiWTdqWEFrUk1rMnRBWXM5Ti9RTWRVQjJnaTJScUhiN3ZobmRRaHlaKzkKMFVpNUFvSUJBRHJDNWZ5UFBFQjl0WXVQWlVaQ2thVWFWUHJYUVlmbkJnRXp5S1Z6di82WHhHTDZ6a1hBZ21VNAptSk01Yi9leFpWZ0ZTVWNsOFZGR1Q4Rm4yZktxS0krYWhwQWd6aEo1cGxuNXk4MXdxZjNXdEhiZG1BRGh4Z1R2CnFRTmZoSEJ0S2VuYlY1M0dKdmZVS01abUhqeUpkeHRiOTg2UkNZYzYyQVhwcmhxaExjd1RQMHlpbHM1QXlvSmYKdkN4TVlTQk5DOEJpT3NUZGZRV1grZVluMU55WnhJL0pSV2pIdWh6eWlXb0pkZUFvR3cyZUJERWRqUjlrT0ZyZApiNDltZ3l4ckNKdEtJeVlZWncraWwrejltUFhsK04zRW1NeElNVXpKdXJyZ0RXZ1YrV0NUYUlscnFjOGF6dkxmCjhDQmhzWWdXbEtUNVpFYWlIQ3dyVUpjMEpDc21jTEVDZ2dFQUlMejNxNm1SUkVOSTNkNDc0ZzBXY1h3STNzU2kKVE9yM3NjZUp1Ui9EZEhrbWRvbE0zWk84S2g2N2N2emdYdERjdU9sWWowQW1YRnoxU2FQWUw1VmRzbVVvZmtOTwpjNTcvWUYxRTROcHVXRFNlWVZvS2VJcTFNMkVMS1diUFJsYks0aWdJV0dxT1JOVW55Nlh6ajJHRHZhbDhNbWg4CjhXWFluenVQT2NmbEl3NmpPZ1F1Ulh4MEZtUDZhV2FnN0UrVVFCeVNTeFVTa2twR0lqYlpjVUhrUkl0QVVjMEwKL3R2dWRFMkEvRGRBL01rc040MXpPQlV5R0sxaTNwNnFOTEYyS09JSGdRcGYzUTUyY1BwSmxzc2M4T3F3RlI5TwpIblFFNldsNDd0OFpwMmJvVktvRGl1YTFHN3BqUms5NzFMcWkxOGZGS2xVcG0xZ0dmNk5keHoyekRnPT0KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUU2VENDQXRHZ0F3SUJBZ0lSQU5lb0MwYlpoSDE4SS9pUDFpYmlGK1V3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpFd05qQXpNRFl3TXpRd1doZ1BNakExTVRBMk1ETXdOakV6TkRCYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCnYvWG1NTmJoSnBmbTNUQmhwZFFiSTcyYllEamdCTGhnMkYxY0x0d3loRkFBLzgrNCtpdHhHT3oxYnVxU0NMUHkKTU9NeUNxdmVxbXcyZHA0SkIwR1YwTEJ4UFdoT3JwVUlweE5WMEpJY0kvMnZqR3RUK0lhbnFKbFNNL2NhaVVJcwpNWXE1YWs4QUVKNWswKzJDM0wrdGhGVklUUGxjUWRPYkdiSitTeHRabURXdDgyUlVqWnNFZ3JhUWlKcXpuRWVECndHb2xqSmxXVE5kQXJTWW05dEdVQndXdXQreFczSGtrcGtqKzJPMlY2WTJmTFhvWjdSY1RzTEkwbDBwMHQ0eWkKVjNsWEtsYzNzbUhMWEl5WmZxc3JLSy9IckpHQlU4UlNQaEZHdHBvSmFCYTQvbnFZT0V0MmdLZCtsNUs2MmZHZApXaFZHU2JQSUFZWG94SWc5K2ovcnE1TXQrbE1WUWpZMkZsdEVET09oRWd5LytzcTQxME9QYS9SV214M0UwdlVwClZCSy9SZ1h0TDFDc1RjOHhnb3VpWUZCT1JhVEx0cDlaN2FjVm5BR1Bwb1FmemRnTUQ1b0RhOVRHcm9KczBvZHkKZGNKdEdHazhoTkRmRFkwa2l1cnhuS2NSK2YvSEN5WmU1WkVqR2wweVF5eVA3bjB1UFByTFVRUVFuN0VBQU0vcAo1SWt3OGlOb05SWElXeGNJdm1GNXFONEN4Ny8vdVZ6RnI4OGtxY2NKeGRLZEJSL3dhSzA4SXV5ZTJCWHJSS0JtClBzQlZSMHpLS01XdXBQcUg1NVV4T2t6blM2aDI1bWVWNHRuMnFlYWtrcytTWkJDU1B6MWprTmpmb0RiY3R4VFkKOTBSdzBIbzA1aUxXbDFUT2haS1BPZGNseUpROHJ6ZDM5MXplUlUreG5wa0NBd0VBQWFOQ01FQXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSnNDQTJnNzZWaitpbFBZCnZzWFBTMU5TcFk2T01BMEdDU3FHU0liM0RRRUJDd1VBQTRJQ0FRQWkvcG5UVUFpNmdQZjVhTFRiQytSbkpuVTMKTHMvWkJHSGlvZTN4UGxOTStwVGZYRHdRWUExaVYzWGNOdGNnS3R6QkIzd2VHUmtkUW5iVXZtYlhMQ1RTc25JawoxcDlyUVlhOU9Za2FUZjd2Njc1UTVpMEErSFhBSjc4SVA1aHVieVpGSjE2OUZUY2VCVmFKaWs1SmRJSnRMN2dVCkpaclJham92WXVwdU1ZU2R0cWVGbzZXU1BVK0ZFMFVDNUg4SFdsTzF3MnBnK0RwUHNNS2J2WmhOejVvekQvSkcKeTFPNVdBYzNUNE5sSzRlTU5WbzY3TnllOTVSbExkTStqalJ1dFIzQ0NZQ2RxV0R1a3hjdXFZaGU4MnAzSmRicwpQZitoS2NoeXkrYWJ5NzZIYmpaaEIvZTdrdTVOYlpyTTNWRGhCTU5ZVVozb3VjWjZOeXIza3hHRzd1U3BZRjJSCitZMWFtdFlLVWZLUnBXd1BpN3FtTnc3R0lCWXBjRkpqQVh2aUJmVUhnY0VWeURhRFhLNU1RNUV1alkxeS80d1UKcExhTVBPTW40YnpaWEd0NGVwSVVLdGVDbUIvSVJMVTZ2WXkxRjdQSk5PWlBEUUNRSmZYZmlRaTdmd1FaL2lRbgpFQy9mK2lvUSthaXBXUnJ2cG9mRkhQNlZXazlIQnNqd29ncnhRSnB5dlc1YTRIZGR6ZGJuSkVNQ0lTQ2VqVjF1Ck9PaWh6eXZsOFExSHQyUjMyVzkzZ0x6TXRWWFV2WlNCb3FFb2dMc0dSL0tvbnQ4bE9rYzd2UUxMa2VBWFdBTVkKcEhtVEdBMnVmejY2cWVlbzlJYXh4Y2hBUUR4SjUxbWJPaUszbCs2NW9tdlFXVmxHRG8yZTFNbCtHTnYwMi9tSAowcCtnYk5QRmxSY21wRmJpdXc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://aks-default-bfaa62f4.hcp.germanywestcentral.azmk8s.io:443"
              - password               = "e1e3977822b96c24b9e57881d3be6e48f08b4f1ead98d009d21788d02e381fd39abe6dac2ff761ad6f06c67bab28d79d94332833ca276b9b1e54d0cb80972da2"
              - username               = "clusterUser_rg-espc-online_aks-office-hours-default"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
      ~ kubelet_identity                = [
          - {
              - client_id                 = "09bbbfd7-652a-44a2-8459-eb6dc3f8a99d"
              - object_id                 = "c8a7121e-8e16-4762-952a-3e417f38841f"
              - user_assigned_identity_id = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online-aks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-office-hours-default-agentpool"
            },
        ] -> (known after apply)
        name                            = "aks-office-hours-default"
      ~ node_resource_group             = "rg-espc-online-aks" -> "rg-aks-office-hours-default-aks" # forces replacement
      ~ private_cluster_enabled         = false -> (known after apply)
      ~ private_dns_zone_id             = "" -> (known after apply)
      ~ private_fqdn                    = "" -> (known after apply)
      ~ private_link_enabled            = false -> (known after apply)
      ~ resource_group_name             = "rg-espc-online" -> "rg-aks-office-hours-default" # forces replacement
        tags                            = {
            "com.thorsten-hans.conference" = "AKS Office Hours"
            "com.thorsten-hans.retention"  = "1-month"
        }
        # (4 unchanged attributes hidden)

      ~ addon_profile {


          ~ oms_agent {
              ~ log_analytics_workspace_id = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.OperationalInsights/workspaces/law-aks-office-hours-default" -> (known after apply)
              ~ oms_agent_identity         = [
                  - {
                      - client_id                 = "42f96a19-26be-4fb2-9e1f-4c8d6a449515"
                      - object_id                 = "81064cbb-6653-4d79-9bcb-c40f164417b3"
                      - user_assigned_identity_id = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourcegroups/rg-espc-online-aks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/omsagent-aks-office-hours-default"
                    },
                ] -> (known after apply)
                # (1 unchanged attribute hidden)
            }
            # (1 unchanged block hidden)
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      ~ default_node_pool {
          - availability_zones           = [] -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - max_count                    = 0 -> null
          ~ max_pods                     = 110 -> (known after apply)
          - min_count                    = 0 -> null
            name                         = "linux"
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
          ~ orchestrator_version         = "1.19.11" -> (known after apply)
          ~ os_disk_size_gb              = 128 -> (known after apply)
            tags                         = {
                "com.thorsten-hans.conference" = "AKS Office Hours"
                "com.thorsten-hans.retention"  = "1-month"
            }
            # (6 unchanged attributes hidden)
        }

      ~ identity {
          + principal_id              = (known after apply)
          + tenant_id                 = (known after apply)
          ~ user_assigned_identity_id = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-aks-default" -> (known after apply)
            # (1 unchanged attribute hidden)
        }


      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ load_balancer_sku  = "Standard" -> (known after apply)
          + network_mode       = (known after apply)
          ~ network_plugin     = "kubenet" -> (known after apply)
          + network_policy     = (known after apply)
          ~ outbound_type      = "loadBalancer" -> (known after apply)
          ~ pod_cidr           = "10.244.0.0/16" -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)

          ~ load_balancer_profile {
              ~ effective_outbound_ips    = [
                  - "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online-aks/providers/Microsoft.Network/publicIPAddresses/51066af6-0533-448f-a9f3-828f0dd5da55",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes   = 0 -> (known after apply)
              ~ managed_outbound_ip_count = 1 -> (known after apply)
              ~ outbound_ip_address_ids   = [] -> (known after apply)
              ~ outbound_ip_prefix_ids    = [] -> (known after apply)
              ~ outbound_ports_allocated  = 0 -> (known after apply)
            }
        }

      ~ role_based_access_control {
          ~ enabled = false -> (known after apply)

          + azure_active_directory {
              + admin_group_object_ids = (known after apply)
              + azure_rbac_enabled     = (known after apply)
              + client_app_id          = (known after apply)
              + managed                = (known after apply)
              + server_app_id          = (known after apply)
              + server_app_secret      = (sensitive value)
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "germanywestcentral"
      + name                       = "law-aks-office-hours-default"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "rg-aks-office-hours-default"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }
      + workspace_id               = (known after apply)
    }

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-espc-online" -> (known after apply)
      ~ name     = "rg-espc-online" -> "rg-aks-office-hours-default" # forces replacement
        tags     = {
            "com.thorsten-hans.conference" = "AKS Office Hours"
            "com.thorsten-hans.retention"  = "1-month"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_role_assignment.acrpull will be created
  + resource "azurerm_role_assignment" "acrpull" {
      + id                               = (known after apply)
      + name                             = "872df478-6ec5-2f04-f3f0-ffd17bfeb1ad"
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.aks will be created
  + resource "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "identity-aks-default"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aks-office-hours-default"
      + tags                = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }
      + tenant_id           = (known after apply)
    }

Plan: 6 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Author: @ThorstenHans, Action: `pull_request`*